Documents/ВозвратСПодряда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВозвратСПодряда</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КомплектыУПодрядчика</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияКомплекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеКомплект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/КомплектыУПодрядчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>КомплектыУПодрядчика</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзделиеКомплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ВозвратСПодряда/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	омЗаполнениеРеквизиов.ЗаполнитьРеквизитыСтандартные(Объект);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ЗаполнитьПоПодрядчикуНаСервере(Дата, Подрядчик, мВыбранныеКомплекты)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КомплектыУПодрядчикаОстатки.ИзделиеКомплект КАК ИзделиеКомплект
		|ИЗ
		|	РегистрНакопления.КомплектыУПодрядчика.Остатки(&Дата, Подрядчик = &Подрядчик) КАК КомплектыУПодрядчикаОстатки
		|ГДЕ
		|	КомплектыУПодрядчикаОстатки.КоличествоОстаток > 0
		|	И НЕ КомплектыУПодрядчикаОстатки.ИзделиеКомплект В (&мВыбранныеКомплекты)
		|
		|УПОРЯДОЧИТЬ ПО
		|	КомплектыУПодрядчикаОстатки.ИзделиеКомплект.Наименование";
	
	Запрос.УстановитьПараметр("Дата", КонецДня(Дата));
	Запрос.УстановитьПараметр("Подрядчик", Подрядчик);
	Запрос.УстановитьПараметр("мВыбранныеКомплекты", мВыбранныеКомплекты);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИзделиеКомплект");
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоПодрядчику(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Подрядчик) Тогда
		ПоказатьПредупреждение(, "Не заполнен подрядчик");
		Возврат;
	КонецЕсли;
	
	мВыбранныеКомплекты = Новый Массив;
	
	Для каждого х Из Объект.ИзделияКомплекты Цикл
		мВыбранныеКомплекты.Добавить(х.ИзделиеКомплект);	
	КонецЦикла;
	
	Для каждого х Из ЗаполнитьПоПодрядчикуНаСервере(Объект.Дата, Объект.Подрядчик, мВыбранныеКомплекты) Цикл
		НС = Объект.ИзделияКомплекты.Добавить();
		НС.ИзделиеКомплект = х;
	КонецЦикла;
	
КонецПроцедуры
